package com.alx.task;

public class Task1 {

    /**
     * Необходимо написать функцию, которая проверяет является ли
     * скобочная последовательность правильной или нет
     * Правильная скобочная последовательность - это такая последовательность,
     * в которой для каждой открытой скобки существует закрытая скобка
     * (())() - правильная
     * (() - не правильная
     * ( - не правильная
     * ((()()()))(()())()()((())) - правильная
     * Особые случаи можно уточнять у интервьюера
     * */
    public static boolean isValidSequence(String source) {
        // TODO: 18.01.2023
        return false;
    }

}
